'''
实战二十一: 模拟支付宝蚂蚁森林的能量产生过程

支付宝的蚂蚁森林通过日常的走步、生活缴费、线下支付、网络购票、共享单车等低碳、环保行为可以积累能量,当能量达到一定数量后,就可以种一颗真正的树。那么本实战将模拟支付宝蚂蚁森林的能量产生过程。
'''
a = input('查询能量请输入能量来源！推出程序请输入0：\n')
print('能量来源如下：\n生活缴费,行走捐，共享单车，线下支付，网络购票')
while True:
    if a == '生活缴费':
        print('300g')
        break
    elif a == '行走捐':
        print('200g')
        break
    elif a == '共享单车':
        print('350g')
        break
    elif a == '线下支付':
        print('380g')
        break
    elif a == '网络购票':
        print('500g')
        break
    elif a == '0':
        print ('已退出')
        break








